; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v12)
             (pred_6 ?v2 ?v13)
             (pred_2 ?v7 ?v13)
             (pred_3 ?v6 ?v7 )
	     (pred_8 ?v7)
             (pred_7 ?v9)
             (pred_10 ?v2)
             (pred_1 ?v13)
             (pred_5 ?v7)
             (pred_12 ?v2)
             (pred_11 ?v7)
             (pred_9 ))



(:action op_5
:parameters (?v3 ?v10 ?v11 ?v1)
:precondition (and (pred_7 ?v3) (pred_7 ?v10) (pred_10 ?v11) (pred_1 ?v1)
          (pred_4 ?v3 ?v10) (pred_6 ?v11 ?v1)
                   (pred_2 ?v10 ?v1) (pred_8 ?v3) 
                   (pred_5 ?v10) (pred_12 ?v11))
:effect (and  (pred_11 ?v10) (not (pred_5 ?v10))))


(:action op_2
:parameters (?v3 ?v4)
:precondition (and (pred_7 ?v3) (pred_7 ?v4)
               (pred_8 ?v3) (pred_4 ?v3 ?v4) (pred_11 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v3))))

(:action op_4
:parameters (?v3 ?v11)
:precondition (and (pred_7 ?v3) (pred_10 ?v11) 
                  (pred_8 ?v3) (pred_3 ?v11 ?v3) (pred_9 ))
:effect (and (pred_12 ?v11)
   (not (pred_3 ?v11 ?v3)) (not (pred_9 ))))


(:action op_3
:parameters (?v3 ?v8 ?v5)
:precondition (and (pred_7 ?v3) (pred_10 ?v8) (pred_10 ?v5)
                  (pred_8 ?v3) (pred_12 ?v5) (pred_3 ?v8 ?v3))
:effect (and (pred_12 ?v8) (pred_3 ?v5 ?v3)
        (not (pred_12 ?v5)) (not (pred_3 ?v8 ?v3))))

(:action op_1
:parameters (?v3 ?v11)
:precondition (and (pred_7 ?v3) (pred_10 ?v11) 
                  (pred_8 ?v3) (pred_12 ?v11))
:effect (and (pred_9 ) (pred_3 ?v11 ?v3) (not (pred_12 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_28 obj_02 obj_25 obj_30 obj_07 obj_01 obj_03 obj_27 obj_16 obj_21 obj_19 obj_05 obj_24 obj_29 obj_17 obj_22 obj_15 obj_12 obj_13 obj_09 obj_04 obj_23 obj_06 obj_10
    obj_14 obj_20
    obj_11 obj_18 obj_08
    )

    (:init
       (pred_9)

       (pred_7 obj_26)
       (pred_7 obj_28)
       (pred_7 obj_02)
       (pred_7 obj_25)
       (pred_7 obj_30)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_27)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_7 obj_19)
       (pred_7 obj_05)
       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_7 obj_17)
       (pred_7 obj_22)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_13)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_23)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_20)
       (pred_10 obj_11)
       (pred_10 obj_18)
       (pred_10 obj_08)

       (pred_4 obj_26 obj_07)
       (pred_4 obj_26 obj_28)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_28 obj_26)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_25 obj_30)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_30 obj_16)
       (pred_4 obj_30 obj_25)
       (pred_4 obj_07 obj_21)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_26)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_27)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_27 obj_24)
       (pred_4 obj_27 obj_16)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_27 obj_03)
       (pred_4 obj_16 obj_29)
       (pred_4 obj_16 obj_30)
       (pred_4 obj_16 obj_27)
       (pred_4 obj_21 obj_17)
       (pred_4 obj_21 obj_19)
       (pred_4 obj_21 obj_07)
       (pred_4 obj_19 obj_22)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_19 obj_21)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_05 obj_24)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_29)
       (pred_4 obj_24 obj_27)
       (pred_4 obj_24 obj_05)
       (pred_4 obj_29 obj_13)
       (pred_4 obj_29 obj_16)
       (pred_4 obj_29 obj_24)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_22)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_22 obj_04)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_19)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_15 obj_23)
       (pred_4 obj_15 obj_12)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_12 obj_15)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_29)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_04 obj_23)
       (pred_4 obj_04 obj_22)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_23 obj_06)
       (pred_4 obj_23 obj_15)
       (pred_4 obj_23 obj_04)
       (pred_4 obj_06 obj_10)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_23)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_06)
       (pred_5 obj_30)
       (pred_5 obj_22)
       (pred_5 obj_24)
       (pred_2  obj_30 obj_14)
       (pred_2  obj_22 obj_20)
       (pred_2  obj_24 obj_14)
       (pred_11 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_02)
       (pred_11 obj_25)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_27)
       (pred_11 obj_16)
       (pred_11 obj_21)
       (pred_11 obj_19)
       (pred_11 obj_05)
       (pred_11 obj_29)
       (pred_11 obj_17)
       (pred_11 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_23)
       (pred_11 obj_06)
       (pred_11 obj_10)

       (pred_6  obj_11 obj_14)
       (pred_6  obj_18 obj_20)
       (pred_6  obj_08 obj_20)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_18 obj_22)
       (pred_3 obj_08 obj_15)
       (pred_8 obj_03)
    )

    (:goal (and
       (pred_3 obj_11 obj_17)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_2 obj_03 obj_01)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_01)
   goals met: 0 of 1
2. (op_2 obj_01 obj_19)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_19)
   goals met: 0 of 1
3. (op_2 obj_19 obj_21)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_21)
   goals met: 0 of 1
4. (op_2 obj_21 obj_17)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_17)
   goals met: 0 of 1
5. (op_2 obj_17 obj_09)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_09)
   goals met: 0 of 1
6. (op_2 obj_09 obj_04)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_04)
   goals met: 0 of 1
7. (op_2 obj_04 obj_23)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_23)
   goals met: 0 of 1
8. (op_2 obj_23 obj_15)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_15)
   goals met: 0 of 1
9. (op_4 obj_15 obj_11)
   deleted: (pred_3 obj_11 obj_15) (pred_9)
   added: (pred_12 obj_11)
   goals met: 0 of 1
10. (op_2 obj_15 obj_23)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_23)
   goals met: 0 of 1
11. (op_2 obj_23 obj_04)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_04)
   goals met: 0 of 1
12. (op_2 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 1
13. (op_2 obj_09 obj_17)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_17)
   goals met: 0 of 1
14. (op_1 obj_17 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_9) (pred_3 obj_11 obj_17)
   goals met: 1 of 1
